#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cicd-series/heroku-prod/runs/run-FTYTLE4uJwEWJDH6

Waiting for the plan to start...

Terraform v0.12.26
Configuring remote state backend...
Initializing Terraform configuration...
2020/06/25 01:01:26 [DEBUG] Using modified User-Agent: Terraform/0.12.26 TFC/133917c07a
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # heroku_app.guestbook_app will be created
  + resource "heroku_app" "guestbook_app" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "cicd-series-guestbook"
      + region                = "us"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_build.guestbook_build will be created
  + resource "heroku_build" "guestbook_build" {
      + app               = "cicd-series-guestbook"
      + buildpacks        = [
          + "https://github.com/heroku/heroku-buildpack-scala",
        ]
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + source            = {
          + "url" = "https://github.com/DWiechert/cicd-series/archive/0.0.1.tar.gz"
        }
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)
    }

  # heroku_formation.guestbook_formation will be created
  + resource "heroku_formation" "guestbook_formation" {
      + app      = "cicd-series-guestbook"
      + id       = (known after apply)
      + quantity = 1
      + size     = "Free"
      + type     = "web"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @DWiechert, Action: `pull_request`, Working Directory: ``, Workflow: `Test CI`*